"""

----------------------------------------- ForeignKey ---------------------------------------
аттрибу on_delete для ForeignKey

on_delete=CASCADE - говорит о том, что все записи будут удаляться каскадом,
т.е. если из главной таблицы удалить запись, то все записи, которые на нее ссылаются будут удалены

on_delete=PROTECT - говорит о том, что запись не может быть удалена, если на нее ссылается хоть одна запись
в другой таблице

on_delete=SET_DEFAULT - даёт возможность задать запись по умолчанию

on_delete=SET_NULL - задаёт NULL для всех дочерних записей, при удалении родительских
но чтобы задать SET_NULL нужно в определении этого поля задать также blank=True, null=True

    blank=True - говорит, что это поле можно не заполнять, когда мы создаём какую-то строчку
    null=True - говорит о том, что это поле может быть пустым, там может быть ничего



"""